Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Confirm disassembler success: When set, the disassembler dialog will stay open after successful TMCL program disassembly.
it_it: Confirm disassembler success: Se impostato, la finestra di dialogo del disassembler rimarrà aperta dopo l'assemblaggio del programma TMCL.

source: Confirm download success: When set, the download dialog will stay open after successful TMCL program download to a module.
it_it: Confirm download success: Se impostata, la finestra di dialogo del download rimarrà aperta dopo il download riuscito del programma TMCL in un modulo.

source: Connect CH347 and STM32F4 (openocd.exe -f ch347.cfg -f + parameter: here the parameter is the configuration file of the connected chip, you can copy the file to the bin folder in the 2nd point, otherwise you need to add the path of the configuration file.)
it_it: Collegare CH347 e STM32F4 (openocd.exe -f ch347.cfg -f + parametro: qui il parametro è il file di configurazione del chip collegato; è possibile copiare il file nella cartella bin nel secondo punto, altrimenti è necessario aggiungere il path del file di configurazione).

source: Connect the D/C pin of the OLED to VCC (Connecting to GND for sending commands, to VCC for sending data):
it_it: Collegare il pin D/C dell'OLED a VCC(Collegamento a GND per l'invio dei comandi, a VCC per l'invio dei dati):

source: Connect the PH2.0 to 2.54mm male connector to the Sensor AD interface of the board
it_it: Collegare il connettore maschio PH2.0-2,54 mm all'interfaccia Sensor AD della board.

source: Connect the Raspberry Pi and USB TO UART/I2C/SPI/JTAG, and query "ls /dev/tty*", the new device is the device number of the product:
it_it: Collegare il Raspberry Pi e l'USB a UART/I2C/SPI/JTAG e digitare "ls /dev/tty*", il nuovo dispositivo è il numero del dispositivo del prodotto:

source: Connect the Raspberry Pi and USB TO UART/I2C/SPI/JTAG, query "ls /dev/tty*" again, and the new device is the device number of the product.
it_it: Collegare il Raspberry Pi e USB a UART/I2C/SPI/JTAG, interrogare nuovamente "ls /dev/tty*" e il nuovo dispositivo sarà il numero di dispositivo del prodotto.

source: Connect the UART port of the board to the computer using a USB cable
it_it: Collegare la porta UART della scheda al computer tramite un cavo USB

source: Connect the board to the computer using a USB cable
it_it: Collegare la board al computer tramite un cavo USB.

source: Connect the development board to USB to RS485 converter, as shown in the figure
it_it: Collegare la scheda di sviluppo al convertitore USB-RS485, come mostrato in figura

source: Connect the development board to USB-CAN-A, as shown in the figure
it_it: Collegare la scheda di sviluppo a USB-CAN-A, come mostrato in figura

source: Connect the fifth wire of TF-Luna first, and then connect the other wires in turn.
it_it: Collegare prima il quinto cavo del TF-Luna, poi collegare gli altri cavi a turno.

source: Connect: Click the Connect button to open the connection and to start searching for modules connected to the CAN bus.
it_it: Connect: Cliccare sul pulsante Connect per aprire la connessione e iniziare la ricerca dei moduli collegati al bus CAN.

source: Connect: Click the Connect button to open the connection and to start searching for modules connected to the serial port.
it_it: Connect: Cliccare sul pulsante Connect per aprire la connessione e iniziare la ricerca dei moduli connessi alla porta seriale.

source: Connection
it_it: Connessione

source: Connector
it_it: Connettore

source: Constant Expressions
it_it: Espressioni Costanti

source: Constant TOff Mode: This will switch off the SpreadCycle chopper scheme and will use a classic constant off time chopper scheme instead.
it_it: Constant TOff Mode: Questa modalità disattiva lo schema chopper SpreadCycle e utilizza invece uno schema chopper classico con tempo di spegnimento costante.

source: Contents
it_it: Contenuti

source: Converts from degrees to radiant
it_it: Converte da gradi a radiante

source: Converts from radiant to degrees
it_it: Converte da radiante a gradi

source: Copy the files with the ".so" extension to the program folder.
it_it: Copiare i file con estensione ".so" nella cartella del programma.

source: Copy the hex file to the directory "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\bin".
it_it: Copiare il file esadecimale nella directory "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\bin".

source: Copy the new EDS files into the UserEds directory.
it_it: Copiare i nuovi file EDS nella directory UserEds.

source: Cosinus
it_it: Coseno

source: Cosinus hyperbolicus
it_it: Coseno iperbolico

source: Create Demo
it_it: Creazione di Demo

source: Cubic root
it_it: Radice cubica

source: Current State: In this section the current state of the state machine is shown.
it_it: Current State: In questa sezione viene visualizzato lo stato attuale della macchina a stati.

source: Current down step (SAP 169): determines how fast the current is to be lowered when the load value is above upper end of the CoolStep hysteresis.
it_it: Current down step (SAP 169): determina la velocità con cui la corrente deve essere ridotta quando il valore del carico è superiore al limite superiore dell'isteresi CoolStep.

source: Current minimum (SAP 168): this can be 1/2 or 1/4 of the run current.
it_it: Current minimum (SAP 168): può essere pari a 1/2 o 1/4 della corrente di funzionamento.

source: Current up step (SAP 171): determines how fast the current is to be raised when the load value is below the lower end of the CoolStep hysteresis.
it_it: Current up step (SAP 171): determina la velocità con cui la corrente deve essere aumentata quando il valore del carico è inferiore al limite inferiore dell'isteresi CoolStep.

source: Currently there are two development tools and frameworks, Arduino IDE and ESP-IDF, providing flexible development options, you can choose the right development tool according to your project needs and personal habits.
it_it: Attualmente sono disponibili due strumenti e framework di sviluppo, Arduino IDE e ESP-IDF, che offrono opzioni di sviluppo flessibili. È possibile scegliere lo strumento di sviluppo più adatto alle esigenze del progetto e alle proprie abitudini.

source: Currently using the Raspberry Pi 64-bit libraries, if your query result is aarch64, then you do not need to do the following operations.
it_it: Attualmente utilizzando le librerie Raspberry Pi a 64 bit, se il risultato della query è aarch64, non è necessario eseguire le seguenti operazioni.

source: Currently, under ESP-IDF v5.3, the average frame rate limit for running the LVGL benchmark demo with a single core is 26 frames per second, corresponding to an interface frame rate of 41 (PCLK 21 MHz).
it_it: Attualmente, con ESP-IDF v5.3, il limite medio di frame rate per l'esecuzione della demo del benchmark LVGL con un singolo core è di 26 frame al secondo, corrispondenti a un frame rate dell'interfaccia di 41 (PCLK 21 MHz).

source: Cyclic: The flags view can either be updated automatically or manually.
it_it: Cyclic: La vista flag può essere aggiornata automaticamente o manualmente.

source: DCF Value Overview
it_it: Panoramica dei Valori DCF

source: DLL files should be placed in the directory where the demo program is located.
it_it: I file DLL devono essere posizionati nella directory in cui si trova il programma demo.

source: DONE: Lithium battery charging completed indicator
it_it: DONE: Indicatore di carica della batteria al litio completata

source: Data cable D+
it_it: Cavo dati D+

source: Data cable D-
it_it: Cavo dati D-

source: Data enable signal
it_it: Segnale di abilitazione dati

source: Data input
it_it: Ingresso dati

source: Data output
it_it: Uscita dati

source: Datasheets
it_it: Datasheet

source: Date
it_it: Data

source: Debugging tool
it_it: Strumento di debug

source: Decimal: Selects decimal value representation (same function as double clicking the value).
it_it: Decimal: Seleziona la rappresentazione decimale (stessa funzione del doppio clic sul valore).

source: Default: Sets all graph scaling parameters back to default values.
it_it: Default: Ripristina tutti i parametri di ridimensionamento del grafico ai valori predefiniti.

source: Delay between TMCL requests: This is the polling interval.
it_it: Ritardo tra le richieste TMCL: Questo è l'intervallo di polling.

source: Demo Debug
it_it: Debug Demo

source: Demo Download
it_it: Download della Demo

source: Demo and Materials
it_it: Demo e Materiali

source: Dependency Library
it_it: Dipendenze da Librarie

source: Dependency libraries are automatically downloaded at compile time via IDF component.yml
it_it: Le librerie dipendenti vengono scaricate automaticamente in fase di compilazione tramite IDF component.yml

source: Depending of the capabilities of the module the units are either internal units of the module ([int]) or microsteps per second (pulses per second, [pps]) or revolutions per minute ([prm]).
it_it: A seconda delle capacità del modulo, le unità sono interne al modulo ([int]) o micropassi al secondo (pulses per second, [pps]) o giri al minuto ([prm]).

source: Depending on the Linux distribution and on the used interface (especially when using a CAN interface) it may be necessary to run the TMCL-IDE with administrator rights.
it_it: A seconda della distribuzione Linux e dell'interfaccia utilizzata (soprattutto quando si utilizza un'interfaccia CAN), potrebbe essere necessario eseguire TMCL-IDE con diritti di amministratore.

source: Depending on the capabilities of the module the position mode window looks different.
it_it: A seconda delle capacità del modulo, la finestra della "position mode" appare diversa.

source: Depending on the capabilities of the module the velocity mode window looks different.
it_it: A seconda delle capacità del modulo, la finestra della "velocity mode" appare diversa.

source: Depending on the command, you can also set the type and motor/bank parameter as well as the value parameter.
it_it: A seconda del comando, è anche possibile impostare il tipo e il parametro motore/banco, nonché il parametro valore.

source: Depending on the connected module or evaluation board, different tools appear on the tool tree.
it_it: A seconda del modulo o della scheda di valutazione collegati, nell'albero degli strumenti compaiono strumenti diversi.

source: Depending on the connected module, different tools appear in the tool tree.
it_it: A seconda del modulo connesso, nella struttura ad albero vengono visualizzati strumenti diversi.

source: Depending on the host interfaces the module is equipped with there are different ways to connect the module to the PC.
it_it: A seconda delle interfacce host di cui è dotato il modulo, esistono diversi modi per collegarlo al PC.

source: Depending on the module itself, some settings might not be shown as not all modules support all these settings.
it_it: A seconda del modulo, alcune impostazioni potrebbero non essere visualizzate, poiché non tutti i moduli le supportano tutte.

source: Depending on the module type this tool looks different, as different modules might offer different axis settings.
it_it: A seconda del tipo di modulo, questo strumento ha un aspetto diverso, poiché moduli diversi potrebbero offrire impostazioni degli assi diverse.

source: Depending on the module, all wizards supporting this module are shown.
it_it: A seconda del modulo, vengono visualizzate tutte le procedure guidate che lo supportano.

source: Depending on the number of unconfigured devices and the LSS fastscan timeout setting the LSS fastscan process can take some time (at least 33·LSSf astscan_timeout).
it_it: A seconda del numero di dispositivi non configurati e dell'impostazione del timeout della scansione rapida LSS, il processo di scansione rapida LSS può richiedere del tempo (almeno 33·LSSfastscan_timeout).

source: Depending on the operating system of your PC it might be necessary to install the correct USB driver files for the module you are using.
it_it: A seconda del sistema operativo del PC, potrebbe essere necessario installare i file del driver USB corretti per il modulo in uso.

source: Depending on the operating system their names are either COMxx or /dev/ttyxx where xx stands for any number allocated by the operating system.
it_it: A seconda del sistema operativo, i loro nomi sono COMxx o /dev/ttyxx, dove xx rappresenta un numero qualsiasi assegnato dal sistema operativo.

source: Depending on the operating system they will either be shown as COMxx or /dev/ttyUSBxx, where xx stands for any number allocated by the operating system.
it_it: A seconda del sistema operativo, saranno visualizzati come COMxx o /dev/ttyUSBxx, dove xx indica un numero qualsiasi assegnato dal sistema operativo.

source: Depending on the range between start and end velocity this can take several minutes, as the load value for every velocity value will be measured ten times.
it_it: A seconda dell'intervallo tra la velocità iniziale e quella finale, questa operazione può richiedere diversi minuti, poiché il valore del carico per ogni valore di velocità verrà misurato dieci volte.

source: Depending on the structure of the flags they are grouped into different tabs.
it_it: A seconda della struttura dei flag, questi vengono raggruppati in diversi "tab" [schede].

source: Description
it_it: Descrizione

source: Description: Contains the overall description of the register (like in the chip datasheet).
it_it: Description: Contiene la descrizione generale del registro (come nel datasheet del chip).

source: Determine whether it is time to send a message, if so, send a message and update the last time it was sent
it_it: Determina se è il momento di inviare un messaggio e, in tal caso, lo invia e aggiorna l'ultima volta che è stato inviato.

source: Development Tools
it_it: Strumenti di Sviluppo

source: Device number
it_it: Numero del Device

source: Device specific Tools
it_it: Strumenti specifici del dispositivo

source: Device with Tool Tree
it_it: Device con il Tree

source: Diagnostics
it_it: Diagnostica

source: Dimensions
it_it: Dimensioni

source: Direct mode means that each TMCL command that has been sent to the module directly gets executed.
it_it: "Direct mode" significa che ogni comando TMCL inviato al modulo viene eseguito direttamente.

source: Disclaimer: Intended Use
it_it: Disclaimer: Uso Previsto

source: Disclaimer: Life Support Systems
it_it: Disclaimer: Sistemi di Supporto Vitale

source: Disconnect all the wires between TF-Luna and the device.
it_it: Scollegare tutti i cavi tra il TF-Luna e il dispositivo.

source: Disconnect: Click here to close the connection.
it_it: Disconnect: Cliccare qui per chiudere la connessione.

source: Display interface
it_it: Interfaccia display

source: Display panel
it_it: Pannello display

source: Divide
it_it: Divisione

source: Do not connect USB TO UART/I2C/SPI/JTAG first, and use commands to query the current device.
it_it: Non collegare prima USB a UART/I2C/SPI/JTAG, ma utilizzare i comandi per interrogare il dispositivo corrente.

source: Do not connect USB TO UART/I2C/SPI/JTAG first, use the commands to query the current device:
it_it: Non collegare prima USB a UART/I2C/SPI/JTAG, utilizzare i comandi per interrogare il dispositivo corrente:

source: Do not set too low.
it_it: Non impostare un valore troppo basso.

source: Document Revision
it_it: Revisione del Documento

source: Double click on the displayed contents in order to change between decimal and hexadecimal value representation of the content.
it_it: Doppio clic sul contenuto visualizzato per passare dalla rappresentazione decimale a quella esadecimale.

source: Download and Install Arduino IDE
it_it: Download e Installazione di Arduino IDE

source: Download and Install Visual Studio
it_it: Download e Installazione di Visual Studio

source: Download the I2C debugging software (USB TO UART_I2C_SPI_JTAG Software demo), no need to install it, directly open it to use.
it_it: Scaricare il software di debug I2C (USB TO UART_I2C_SPI_JTAG Software demo), non è necessario installarlo, basta aprirlo direttamente per utilizzarlo.

source: Download the file package to the Raspberry Pi and unzip the file:
it_it: Scaricare il file del pacchetto sul Raspberry Pi e decomprimerlo:

source: Downloading can be aborted by clicking the Abort button.
it_it: Il download può essere interrotto cliccando sul pulsante "Abort".

source: Driver Installation
it_it: Installazione del Driver

source: Driver Installtion
it_it: Installazione del Driver

source: Due to the internal firmware version of the product, it can be solved by using the following firmware update.
it_it: A causa della versione del firmware interno del prodotto, il problema può essere risolto utilizzando il seguente aggiornamento firmware.

source: During single stepping, the next command to be executed is indicated by a green arrow on the left side of the editor.
it_it: Durante l'esecuzione a passo singolo, il comando successivo da eseguire è indicato da una freccia verde sul lato sinistro dell'editor.

source: During this process, the ESP-IDF may take up a lot of CPU resources, so it may cause the system to lag
it_it: Durante questo processo, l'ESP-IDF potrebbe occupare molte risorse della CPU, causando rallentamenti del sistema.

source: During this step, all values sent are also written into the internal DCF file buffer, so that after this step the new values can also be saved to a DCF file (using the Device Configuration tool).
it_it: Durante questa fase, tutti i valori inviati vengono scritti anche nel buffer interno del file DCF, in modo che, dopo questa fase, i nuovi valori possano essere salvati anche in un file DCF (utilizzando il tool Device Configuration).

source: E: parameter can be stored in the EEPROM of the module
it_it: E: il parametro può essere memorizzato nella EEPROM del modulo

source: EDS Files
it_it: File EDS

source: EDS Files for Trinamic Modules
it_it: File EDS per i Moduli Trinamic

source: ESP-IDF Project Details
it_it: Dettagli del Progetto ESP-IDF

source: ESP-IDF is a better choice for developers with a professional background or high performance requirements, as it provides more advanced development tools and greater control capabilities for the development of complex projects.
it_it: ESP-IDF è una scelta migliore per gli sviluppatori con un background professionale o che richiedono elevate prestazioni, poiché fornisce strumenti di sviluppo più avanzati e maggiori capacità di controllo per lo sviluppo di progetti complessi.

source: ESP-IDF official resources
it_it: Risorse ufficiali di ESP-IDF

source: ESP-IDF, or full name Espressif IDE, is a professional development framework introduced by Espressif Technology for the ESP series chips.
it_it: ESP-IDF, o nome completo Espressif IDE, è un framework di sviluppo professionale introdotto da Espressif Technology per i chip della serie ESP.

source: ESP32 Microcontroller's specific display panel control library
it_it: Libreria di controllo del pannello di visualizzazione specifica del microcontrollore ESP32

source: ESP32's I/O expansion library
it_it: Libreria di espansione I/O di ESP32

source: ESP32-Arduino official documentation
it_it: Documentazione ufficiale di ESP32-Arduino

source: ESP32-Arduino official resources
it_it: Risorse ufficiali di ESP32-Arduino

source: ESP32-S3 Datasheet
it_it: Datasheet di ESP32-S3

source: ESP32-S3 Technical reference manual
it_it: Manuale tecnico di riferimento ESP32-S3

source: ESP32-S3-Touch-LCD-4.3 Demo
it_it: Demo di ESP32-S3-Touch-LCD-4.3

source: ESP32-S3-Touch-LCD-4.3 Development board installation instructions
it_it: Istruzioni per l'installazione della scheda di sviluppo ESP32-S3-Touch-LCD-4.3

source: ESP32-S3-Touch-LCD-4.3 library file installation instructions
it_it: Istruzioni per l'installazione del file della libreria ESP32-S3-Touch-LCD-4.3

source: ESP32-S3-Touch-LCD-4.3 library file is stored in the sample program, click here to jump:ESP32-S3-Touch-LCD-4.3 Demo
it_it: Il file della libreria ESP32-S3-Touch-LCD-4.3 è memorizzato nel programma di esempio, cliccare qui per passare a: Demo di ESP32-S3-Touch-LCD-4.3

source: ESP32-S3-Touch-LCD-4.3 waits USB-CAN-A_TOOL to send a message.
it_it: ESP32-S3-Touch-LCD-4.3 attende USB-CAN-A_TOOL per inviare un messaggio.

source: ESP32-S3-WROOM-1 datasheet
it_it: datasheet di ESP32-S3-WROOM-1

source: ESP32_Arduino offline package
it_it: Pacchetto offline ESP32_Arduino

source: Each module is the parent of tools depending of its characteristics.
it_it: Ogni modulo è il padre dei tool, a seconda delle sue caratteristiche.

source: Each module or evaluation board that is equipped with a USB interface can be connected directly via USB.
it_it: Ogni modulo o "evaluation board" dotato di interfaccia USB può essere collegato direttamente tramite USB.

source: Each of these two development approaches has its own advantages, and developers can choose according to their needs and skill levels.
it_it: Ognuno di questi due approcci di sviluppo ha i suoi vantaggi e gli sviluppatori possono scegliere in base alle proprie esigenze e al proprio livello di competenza.

source: Each root entry contains the connected interfaces and each interface is the parent of one or more connected TMC Module.
it_it: Ogni voce radice contiene le interfacce connesse e ciascuna interfaccia è il padre di uno o più moduli TMC connessi.

source: Each setting corresponds to one axis parameter in TMCL.
it_it: Ogni impostazione corrisponde a un parametro dell'asse in TMCL.

source: Either every data point can be logged (when no span is selected), or the data can be logged in configurable spans of seconds or minutes.
it_it: È possibile loggare ogni singolo punto dati (selezionando no span) oppure i dati possono essere registrati in intervalli configurabili di secondi o minuti.

source: Either, use the sudo command (sudo TMCL-IDE.sh), or use the su command before launching the TMCL-IDE.
it_it: Utilizzare il comando sudo (sudo TMCL-IDE.sh) oppure il comando su prima di avviare TMCL-IDE.

source: Enable Python IDLE, click "File" -> Open...
it_it: Abilitare Python IDLE, cliccare su "File" -> Open...

source: Enable Telnet Function.
it_it: Abilitare la Funzione Telnet.

source: Enable USB TO UART_I2C_SPI_JTAG Demo software to enter the I2C debugging interface, and enable the device.
it_it: Abilitare il software "USB TO UART_I2C_SPI_JTAG Demo" per accedere all'interfaccia di debug I2C e abilitare il dispositivo.

source: Enable USB TO UART_I2C_SPI_JTAG Demo software to enter the SPI debugging interface, and enable the device.
it_it: Abilitare il software "USB TO UART_I2C_SPI_JTAG demo" per accedere all'interfaccia di debug SPI e abilitare il dispositivo.

source: Enable two SSCOM demos, and select two COM ports of the product.
it_it: Abilitare due SSCOM demos e selezionare due porte COM del prodotto.

source: Encoder: If supported, all settings specific to the encoder can be set here.
it_it: Encoder: Se supportato, qui è possibile settare tutte le impostazioni specifiche dell'encoder.

source: English system: Explorer->View->Check "Hidden items"
it_it: Sistema inglese: Explorer->View->Check "Hidden items"

source: Enter "halt" in the Telnet window to pause the running demo.
it_it: Inserire "halt" nella finestra Telnet per mettere in pausa la demo in esecuzione.

source: Enter hexadecimal numbers preceded by “0x”, like in C language.
it_it: Inserire i numeri esadecimali preceduti da "0x", come nel linguaggio C.

source: Enter the I2C example directory, and edit the demo I2C.py:
it_it: Accedere alla directory di esempio I2C e modificare il file demo I2C.py:
